numbers = {
    "1": "один",
    "2": "два",
    "3": "три",
    "4": "четыре",
    "5": "пять",
    "6": "шесть",
    "7": "семь",
    "8": "восемь",
    "9": "девять",
    "10": "десять",
    "11": "одиннадцать",
    "12": "двенадцать",
    "13": "тринадцать",
    "14": "четырнадцать",
    "15": "пятнадцать",
    "16": "шестнадцать",
    "17": "семнадцать",
    "18": "восемнадцать",
    "19": "девятнадцать",
    "20": "двадцать",
    "30": "тридцать",
    "40": "четырнадцать",
    "50": "пятьдесят",
    "60": "шестьдесят",
    "70": "семьдесять",
    "80": "весемьдесять",
    "90": "девяносто",
}


def number_to_words(n):
    if n > 20:
        n1 = (n // 10) * 10
        n2 = n % 10
        return numbers.get(str(n1)) + " " + numbers.get(str(n2))
    return numbers.get(str(n))


print(number_to_words(20))